src/integ-test/bdd-test/resources/xml/activatePaymentNoticeV2Body.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<nod:activatePaymentNoticeV2Request>
			<idPSP>#psp#</idPSP>
			<idBrokerPSP>#id_broker_psp#</idBrokerPSP>
			<idChannel>#canale_ATTIVATO_PRESSO_PSP#</idChannel>
			<password>#password#</password>
			<idempotencyKey>#idempotency_key#</idempotencyKey>
			<qrCode>
				<fiscalCode>#creditor_institution_code#</fiscalCode>
				<noticeNumber>302$iuv</noticeNumber>
			</qrCode>
			<expirationTime>6000</expirationTime>
			<amount>10.00</amount>
			<paymentNote>responseFull</paymentNote>
		</nod:activatePaymentNoticeV2Request>
	</soapenv:Body>
</soapenv:Envelope>